espressif/esp-idf/components/soc/esp32h4/register/soc/uhci_struct.h
/**
 * SPDX-FileCopyrightText: 2025-2026 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Configuration Register */
/** Type of conf0 register
 *  UHCI configuration register
 */
typedef union {
    struct {
        /** tx_rst : R/W; bitpos: [0]; default: 0;
         *  Write 1 and then write 0 to reset the decoder state machine.
         */
        uint32_t tx_rst:1;
        /** rx_rst : R/W; bitpos: [1]; default: 0;
         *  Write 1 and then write 0 to reset the encoder state machine.
         */
        uint32_t rx_rst:1;
        /** uart_sel : R/W; bitpos: [4:2]; default: 7;
         *  Configures to select which uart to connect with UHCI.
         *  0: UART0
         *  1: UART1
         */
        uint32_t uart_sel:3;
        /** seper_en : R/W; bitpos: [5]; default: 1;
         *  Configures whether or not to separate the data frame with a special character.
         *  0: Not separate
         *  1: Separate
         */
        uint32_t seper_en:1;
        /** head_en : R/W; bitpos: [6]; default: 1;
         *  Configures whether or not to encode the data packet with a formatting header.
         *  0: Not use formatting header
         *  1: Use formatting header
         */
        uint32_t head_en:1;
        /** crc_rec_en : R/W; bitpos: [7]; default: 1;
         *  Configures whether or not to enable the reception of the 16-bit CRC.
         *  0: Disable
         *  1: Enable
         */
        uint32_t crc_rec_en:1;
        /** uart_idle_eof_en : R/W; bitpos: [8]; default: 0;
         *  Configures whether or not to stop receiving data when UART is idle.
         *  0: Not stop
         *  1: Stop
         */
        uint32_t uart_idle_eof_en:1;
        /** len_eof_en : R/W; bitpos: [9]; default: 1;
         *  Configures when the UHCI decoder stops receiving data.
         *  0: Stops after receiving 0xC0
         *  1: Stops when the number of received data bytes reach the specified value. When
         *  UHCI_HEAD_EN is 1, the specified value is the data length indicated by the UHCI
         *  packet header. when UHCI_HEAD_EN is 0, the specified value is the configured value.
         */
        uint32_t len_eof_en:1;
        /** encode_crc_en : R/W; bitpos: [10]; default: 1;
         *  Configures whether or not to enable data integrity check by appending a 16 bit
         *  CCITT-CRC to the end of the data.
         *  0: Disable
         *  1: Enable
         */
        uint32_t encode_crc_en:1;
        /** clk_en : R/W; bitpos: [11]; default: 0;
         *  Configures clock gating.
         *  0: Support clock only when the application writes registers.
         *  1: Always force the clock on for registers.
         */
        uint32_t clk_en:1;
        /** uart_rx_brk_eof_en : R/W; bitpos: [12]; default: 0;
         *  Configures whether or not to stop UHCI from receiving data after UART has received
         *  a NULL frame.
         *  0: Not stop
         *  1: Stop
         */
        uint32_t uart_rx_brk_eof_en:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} uhci_conf0_reg_t;

/** Type of conf1 register
 *  UHCI configuration register
 */
typedef union {
    struct {
        /** check_sum_en : R/W; bitpos: [0]; default: 1;
         *  Configures whether or not to enable header checksum validation when UHCI receives a
         *  data packet.
         *  0: Disable
         *  1: Enable
         */
        uint32_t check_sum_en:1;
        /** check_seq_en : R/W; bitpos: [1]; default: 1;
         *  Configures whether or not to enable the sequence number check when UHCI receives a
         *  data packet.
         *  0: Disable
         *  1: Enable
         */
        uint32_t check_seq_en:1;
        /** crc_disable : R/W; bitpos: [2]; default: 0;
         *  Configures whether or not to enable CRC calculation.
         *  0: Disable
         *  1: Enable
         *  Valid only when the Data Integrity Check Present bit in UHCI packet is 1.
         */
        uint32_t crc_disable:1;
        /** save_head : R/W; bitpos: [3]; default: 0;
         *  Configures whether or not to save the packet header when UHCI receives a data
         *  packet.
         *  0: Not save
         *  1: Save
         */
        uint32_t save_head:1;
        /** tx_check_sum_re : R/W; bitpos: [4]; default: 1;
         *  Configures whether or not to encode the data packet with a checksum.
         *  0: Not use checksum
         *  1: Use checksum
         */
        uint32_t tx_check_sum_re:1;
        /** tx_ack_num_re : R/W; bitpos: [5]; default: 1;
         *  Configures whether or not to encode the data packet with an acknowledgment when a
         *  reliable packet is to be transmitted.
         *  0: Not use acknowledgement
         *  1: Use acknowledgement
         */
        uint32_t tx_ack_num_re:1;
        uint32_t reserved_6:1;
        /** wait_sw_start : R/W; bitpos: [7]; default: 0;
         *  Configures whether or not to put the UHCI encoder state machine to ST_SW_WAIT state.
         *  0: No
         *  1: Yes
         */
        uint32_t wait_sw_start:1;
        /** sw_start : WT; bitpos: [8]; default: 0;
         *  Write 1 to send data packets when the encoder state machine is in ST_SW_WAIT state.
         */
        uint32_t sw_start:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} uhci_conf1_reg_t;

/** Type of escape_conf register
 *  Escape character configuration
 */
typedef union {
    struct {
        /** tx_c0_esc_en : R/W; bitpos: [0]; default: 1;
         *  Configures whether or not to decode character 0xC0 when DMA receives data.
         *  0: Not decode
         *  1: Decode
         */
        uint32_t tx_c0_esc_en:1;
        /** tx_db_esc_en : R/W; bitpos: [1]; default: 1;
         *  Configures whether or not to decode character 0xDB when DMA receives data.
         *  0: Not decode
         *  1: Decode
         */
        uint32_t tx_db_esc_en:1;
        /** tx_11_esc_en : R/W; bitpos: [2]; default: 0;
         *  Configures whether or not to decode flow control character 0x11 when DMA receives
         *  data.
         *  0: Not decode
         *  1: Decode
         */
        uint32_t tx_11_esc_en:1;
        /** tx_13_esc_en : R/W; bitpos: [3]; default: 0;
         *  Configures whether or not to decode flow control character 0x13 when DMA receives
         *  data.
         *  0: Not decode
         *  1: Decode
         */
        uint32_t tx_13_esc_en:1;
        /** rx_c0_esc_en : R/W; bitpos: [4]; default: 1;
         *  Configures whether or not to replace 0xC0 by special characters when DMA sends data.
         *  0: Not replace
         *  1: Replace
         */
        uint32_t rx_c0_esc_en:1;
        /** rx_db_esc_en : R/W; bitpos: [5]; default: 1;
         *  Configures whether or not to replace 0xDB by special characters when DMA sends data.
         *  0: Not replace
         *  1: Replace
         */
        uint32_t rx_db_esc_en:1;
        /** rx_11_esc_en : R/W; bitpos: [6]; default: 0;
         *  Configures whether or not to replace flow control character 0x11 by special
         *  characters when DMA sends data.
         *  0: Not replace
         *  1: Replace
         */
        uint32_t rx_11_esc_en:1;
        /** rx_13_esc_en : R/W; bitpos: [7]; default: 0;
         *  Configures whether or not to replace flow control character 0x13 by special
         *  characters when DMA sends data.
         *  0: Not replace
         *  1: Replace
         */
        uint32_t rx_13_esc_en:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} uhci_escape_conf_reg_t;

